module.exports = {
    fields: [
        {
            name: 'title',
            config: { boost: 10 }
        }, {
            name: 'body'
        }
    ],
    documents: [
        {
            "title": "Σημαντικές οδηγίες ασφαλείας",
            "body": "Διαβάστε προσεκτικά αυτές τις πληροφορίες και εξετάστε τον εξοπλισμό ώστε να εξοικειωθείτε με αυτόν πριν αποπειραθείτε να τον εγκαταστήσετε, χειριστείτε, επιδιορθώσετε ή συντηρήσετε. Τα ακόλουθα μηνύματα ασφαλείας ενδέχεται να εμφανιστούν οπουδήποτε στο παρόν εγχειρίδιο ή στον εξοπλισμό για να προειδοποιήσουν για πιθανούς κινδύνους ή να επιστήσουν την προσοχή σε πληροφορίες που αποσαφηνίζουν ή απλοποιούν μια διαδικασία.",
            "id": 1
        }, {
            "title": "Σημείωση",
            "body": "Η εγκατάσταση, η λειτουργία, η επιδιόρθωση και η συντήρηση του ηλεκτρικού εξοπλισμού πρέπει να γίνεται από καταρτισμένο προσωπικό. Η Acme Corporation δεν αναλαμβάνει καμία ευθύνη για οποιεσδήποτε συνέπειες προκύψουν από τη χρήση αυτού του υλικού.",
            "id": 2
        }
    ],
    tests: [
        {
            what: "find the word %w",
            search: "εγκατάσταση",
            found: 1
        }, {
            what: "find the word %w",
            search: "προσοχή",
            found: 1
        }, {
            what: "never find a word that does not exist, like %w",
            search: "inexistent",
            found: 0
        }, {
            what: "find a correctly stemmed word %w",
            search: "εγκατάστασης",
            found: 1
        }
    ]
}
